Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: ENTER OPEN SOURCE COMPLIANCE Open source initiatives and projects provide companies and other organizations with a vehicle to accelerate innovation through collaboration with the hundreds and sometimes thousands of communities that represent the developers of the open source software.
ja: オープンソースコンプライアンス手始め オープンソースのイニシアチブやプロジェクトを使う事で、企業や組織はオープンソースソフトウェアの開発者を代表する数百、時に数千のコミュニティと協力し、イノベーションを加速できるようになります。

source: ENTER OPEN SOURCE COMPLIANCE 19
ja: オープンソースコンプライアンス手始め 19

source: ESTABLISHING AN OPEN SOURCE MANAGEMENT PROGRAM
ja: オープンソース管理プログラムの確立

source: EXECUTIVE SUPPORT
ja: 役員のサポート

source: Early submission and review of open source usage requests.
ja: オープンソースの利用申請の早めの提出と評価

source: Early success in Linux and other open source technologies has spread to all areas of technology.
ja: Linuxや他のオープン ソース技術における初期段階の成功は、技術の全ての分野にも広がってきています。

source: Education
ja: 教育

source: Education 36
ja: 教育 36

source: Education is an essential building block in a compliance program, to help ensure that employees possess a good understanding of policies governing the use of open source software.
ja: 教育はコンプライアンスプログラムにおいて必須の構成要素で、オープンソースソフトウェアの利用を取り仕切るポリシーを従業員がよく理解する基礎となります。

source: Email communication providing executive support and of open source compliance activities
ja: オープンソース コンプライアンス活動を幹部がサポートする電子メールでの対話

source: Email communication providing executive support and of open source compliance activities .
ja: オープンソースコンプライアンス活動を幹部がサポート する電子メールでの対話

source: Embarrassment and/or bad publicity with customers and open source community.
ja: 顧客やオープンソースコミュニティにおいて困惑や悪い評判を招く

source: Embarrassment with customers, distributors, third party proprietary software suppliers and an open source community
ja: 顧客、ディストリビュータ、サードパーティのソフトウェア供給者、そしてオープンソース コミュニティを困惑させます

source: Enable organizations to benefit from open source while complying with obligations .
ja: 組織に義務を履行させつつ、一方で組織がオープン ソースから恩恵を得られるようにします。

source: Enabling an outward-facing service
ja: 外部向けサービスを可能にする

source: End-to-end compliance process
ja: 一貫したコンプライアンス プロセス

source: End-to-end compliance process The remainder of this chapter will address each of these ten steps in detail.
ja: 一貫したコンプライアンス プロセス この章の残りの部分では、これらの10ステップについて詳しく説明します。

source: Enforced design and architectural review, in addition to code inspections, to analyze the interactions between open source, proprietary code, and third party software components.
ja: 設計とアーキテクチャの評価をソースコードの検査に加えて強制します。これはオープンソース、プロプラエタリ、そしてサードパーティのソフトウェア コンポーネントのコードの関係を解析するためです。

source: Engineering and Product Team Representative
ja: エンジニアリングおよび製品チームの代表

source: Engineering and product teams may have one or more representatives who participates in the OSRB, tracks down all compliance-related tasks assigned to engineering, and ensures proper resolution.
ja: エンジニアリングと製品のチームはOSRBに一人または複数の代表を出し、エンジニアリング チームに割り当てられたコンプライアンス関連のタスク全てを追跡し、適切、確実に解決します。

source: Engineering fixes the identified issue.
ja: 技術担当は、特定された課題を解決します。

source: Engineering staff or Product Management is required to inform the Open Source Review Board (OSRB; described in Chapter 3) or compliance team of the intent to use specific open source in a specific product or platform release.
ja: 技術担当か製品マネージャは、OSRB（3章で説明）かコンプライアンス チームに特定製品やプラットフォーム リリースに特定のオープン ソースを利用したい旨を通知することが求められています。

source: Engineers must receive approval from OSRB before integrating any open source in a product.
ja: 技術者は、いかなるオープン ソースであっても製品に統合する前には、OSRBから承認を得ることが必要です。

source: Ensure Compliance Prior to Product Shipment/Service Launch
ja: 製品出荷やサービス立ち上げに先立ちコンプライアンスを確実に行う

source: Ensure Compliance Prior to Product Shipment/Service Launch 28
ja: 製品出荷やサービス立ち上げに先立ちコンプライアンスを確実に行う 28

source: Ensure availability of a dedicated compliance team.
ja: 専任のコンプライアンス チームを確保します。

source: Ensure completion of OS training is part of employees’ professional development plan and is monitored for completion as part of the performance review process
ja: オープンソースの訓練は従業員のキャリア開発計画の一部であり、業績評価プロセスの一部としてモニタされていることを念押し

source: Ensure inclusion of a copy of the license text, if not already present, in a LICENSE file in the source code root folder of the open source package.
ja: もし、まだ入っていなければ、オープン ソース パッケージのソース コード ルート フォルダにあるLICENSEファイルに、ライセンス文のコピーを追加します。

source: Ensure review and approval of each new version of open source components
ja: オープン ソース コンポーネントの各新しいバージョンが、レビューされ、承認されることを確実にします。

source: Ensure review and approval of each new version of open source components License changes can occur between version upgrades.
ja: オープン ソース コンポーネントの各新しいバージョンが、レビューされ、承認されることを確実にします。

source: Ensure that all the pre-distribution verifications have been successfully completed.
ja: 全ての頒布前検証が問題なく完了していることを確実にします。

source: Ensure that any inbound software does not contain undeclared open source.
ja: 入るソフトウェアが、利用宣言されていないオープン ソースを含んでいないことを確実にします。

source: Ensure that any modifications to source code are documented in compliance with the open source license prior to distribution.
ja: ソース コードに加えられるいかなる変更も、オープン ソース ライセンスに適合して頒布前に文書化されることを確実にします。

source: Ensure that auditing is a milestone in the iterative development process
ja: 繰り返される開発プロセスのマイルストーンに監査を確かに入れ込む

source: Ensure that each modified source code file contains an additional entry for a copyright notice, disclaimer, and a generic “change log” entry.
ja: 変更されたソース コード ファイルは、著作権表記や免責事項の記載や一般的な変更履歴への記載を含んでいることを確認します。

source: Ensure that each new version of the same open source component is reviewed and approved.
ja: 同じオープン ソース コンポーネントの新しいバージョンがレビューされ承認されることを確実にします。

source: Ensure that existing license, copyright, and attribution notices are not disturbed.
ja: 既存のライセンス表記、著作権表記、帰属表記に手が入っていないことを確実にします。

source: Ensure that staff is allocated to the compliance function, and that adequate compliance training is provided to every employee in the organization.
ja: スタッフがコンプライアンスの職務のために割り当てられ、十分なコンプライアンスの訓練が組織の全従業員に確実に施されていなければなりません。

source: Ensure that the end users of the product know how to locate this information, whether on the product itself, in the product documentation (user manual or CD-ROM), and/or on a website.
ja: 製品のエンド ユーザーが、この情報が、製品そのものの中、製品文書（ユーザーマニュアルまたはCD-ROM）の中、かつ／またはウェブサイトなど、どこに置かれているかを知ることができるようにします。

source: Ensure that the open source package compiles on a non-corporate machine.
ja: オープン ソース パッケージは、企業のものでないマシンでコンパイルできることを確認します。

source: Ensuring engineers consistently fill out request forms for each open source component they want to use
ja: 技術者が利用したいオープン ソース コンポーネント毎に一貫して要求フォームを確実に記入するようにします。

source: Ensuring engineers consistently fill out request forms for each open source component they want to use .
ja: 技術者が利用したいオープン ソース コンポーネント毎に一貫して要求フォームを確実に記入するようにします。

source: Ensuring mutual compliance with third-party software and open source software licenses.
ja: サードパーティのソフトウェアとオープンソースのソフトウェア ライセンスとが相互にコンプライアンスを確かに満たすようにします

source: Enter new software components into the compliance end-to-end process.
ja: 新しいソフトウェア コンポーネントをコンプライアンス プロセスに入力します。

source: Escalate compliance issues to OSEC .
ja: コンプライアンス上の課題をOSECに上げます。

source: Essential elements of an open source management program
ja: オープンソース 管理プログラムの必須構成要素

source: Establish and maintain the open source policy and process.
ja: オープンソースのポリシーとプロセスを確立し維持

source: Establish policies and processes.
ja: ポリシーとプロセスを確立

source: Establish the Compliance End-to-End Process: The OSRB is responsible for creating the compliance end-to-end process including usage, audit, development, engagement, assurance, and compliance management.
ja: エンド ツー エンド（端から端まで）のコンプライアンス プロセスの確立します。OSRBはエンドツーエンドのコンプライアンスプロセス、すなわち利用、監査、開発、関与、保障、コンプライアンス管理に責任を持ちます。

source: Establishing a Clean Software Baseline
ja: クリーンなソフトウェア起点 の確立

source: Establishing a Clean Software Baseline 41
ja: クリーンなソフトウェア起点 の確立 41

source: Events that trigger a source code scan
ja: ソース コード スキャンを開始するイベント

source: Example BOM difference report
ja: BOM差分報告の例

source: Example bug-tracking tools commonly employed for compliance:
ja: コンプライアンスで広く利用される不具合追跡ツールの例

source: Example license categories (for illustration purposes only)
ja: ライセンスカテゴリの例（説明目的にのみ使用）

source: Example license compatibility matrix (for illustration purposes only)
ja: ライセンス両立性マトリックスの例（説明目的のみに使用）

source: Example license playbook for GPL v2 (for illustration purposes only)
ja: GPL v2 ライセンス プレーブック例（説明目的のみに使用）

source: Example of an incremental compliance process
ja: インクリメンタル コンプライアンス プロセスの例

source: Example of incremental compliance
ja: 積み上げのコンプライアンスの例

source: Examples of intellectual property failures
ja: 知財上の失敗の例

source: Examples of intellectual property failures Problem Type
ja: 知財上の失敗の例 問題の類型

source: Examples of license compliance problems and how to avoid them
ja: ライセンス コンプライアンス問題の例と回避方法

source: Examples of license compliance problems and how to avoid them Problem Type
ja: ライセンスコンプライアンス問題の例と回避方法 問題の類型

source: Examples of pre-distribution verifications include:
ja: 頒布前検証の例としては以下があります。

source: Examples of such failures include:
ja: 下記はこうした失敗の例です。

source: Executing the distribution .
ja: 頒布を実行します。

source: Executive-level commitment is essential to ensure sustainability of compliance activities.
ja: 役員レベルのコミットメントがコンプライアンス活動を持続させる上で必須です。

source: Existing Licensing Information
ja: 既存ライセンス情報

source: Existing software components may have been retired.
ja: 既存のソフトウェア コンポーネントが、既に使用中止になっているかもしれません。

source: Existing software components may have been upgraded to a newer version.
ja: 既存のソフトウェア コンポーネントが、新しいバージョンに更新されているかもしれません。

source: Existing software components may have code changes involving bug fixes or changes to functionality and architecture.
ja: 既存のソフトウェア コンポーネントが、不具合修正を含むコード変更や、機能やアーキテクチャーに対する変更を含んでいるかもしれません。

source: Exposes IP?
ja: IPを開示するか?

source: External Communication
ja: 外部との対話

source: External communications can take one of several forms:
ja: 外部との対話は下記のいずれでも可能です。

source: FAILURE TO COMPLY
ja: コンプライアンスの失敗

source: FAILURE TO COMPLY 21
ja: コンプライアンスの失敗 21

source: Facilitate effective use of open source in commercial products.
ja: オープンソースが商用製品で効果的に使われることを助ける

source: Facilitating effective usage of and contributions to open source software.
ja: オープンソース ソフトウェアの効果的な利用、およびオープンソース ソフトウェアへの寄与を促進

source: Failure
ja: 失敗

source: Failure of developers to request approval from the internal open source committee (sometimes called Open Source Review Board) to use open source software, or failure to submit a request in time
ja: 開発者が企業内のオープンソース委員会 (時にオープンソース評価委員会と呼ばれる) オープンソース ソフトウェアの利用申請をしない、期限までに行わない

source: Failure to audit the source code
ja: ソースコードの監査を行わない

source: Failure to mark open source code that has been changed or to include a description of the changes
ja: 変更されたオープンソースのコードにマークを付け忘れる、変更の記述を入れ忘れる

source: Failure to provide a modification notice.
ja: 変更表示の付け忘れ

source: Failure to provide a proper attribution notice.
ja: 不適切な帰属表示

source: Failure to provide a written offer for example when using GPL/LGPL license source code.
ja: GPL/LGPL等のライセンスのソースコードを使う際に書面で告知しない

source: Failure to provide correct version of the source code corresponding to the shipped binaries
ja: 出荷されたバイナリと異なるバージョンのソースコードを提供

source: Failure to provide the build scripts needed to compile the source code (per GPL and LGPL family of licenses).
ja: ビルド用スクリプトを提供しない コンパイルに必要なもの（GPLやLGPLファミリのライセンス毎に）。

source: Failure to provide the source code.
ja: ソースコード提供の失敗

source: Failure to publish or make available source code packages as part of meeting license obligations
ja: ライセンス上の義務の一環としてソースコードのパッケージを公開したり利用可能としたりし損ねる

source: Failure to release modifications that were introduced to the open source software being incorporated into the shipping product
ja: 出荷製品に組み込まれたオープンソース ソフトウェアへの変更をリリース忘れ

source: Failure to resolve the audit findings
ja: 監査で発見された問題を解決しない

source: Failure to take the open source training
ja: オープンソースの訓練を受けない

source: Feedback from the compliance officer regarding the compliance ticket (concerns, additional questions, etc.).
ja: コンプライアンス チケットに関するコンプライアンス オフィサーからの（懸念点や追加の質問などの）フィードバック

source: Feedback from the engineering representative in the OSRB or from the engineer (package owner) who follows/maintains this package internally.
ja: OSRBの技術代表や、内部的にこのパッケージを担当／保守する技術者（パッケージのオーナー）からのフィードバック

source: Field
ja: 区分

source: Figure 1 illustrates the major building blocks of a traditional hardware and software platform.
ja: 図１は従来のハードウェア、ソフトウェアのプラットフォームについて主なブロックを示したものです。

source: Figure 1.
ja: 図1

source: Figure 10 offers a high-level overview of a sample end-to-end compliance process, and illustrates the various compliance steps or phases that components containing free and open source software undergo before receiving approval for integration in an externally distributed product or service.
ja: 図10は、一貫したコンプライアンス プロセスの高水準の概要図の一例を提示しており、外部出荷される製品やサービスへの統合許可を受ける前にフリー オープン ソース ソフトウェアを含むコンポーネントが通過する様々なコンプライアンス ステップやフェーズを図示しています。

source: Figure 10.
ja: 図10

source: Figure 11.
ja: 図11

source: Figure 12.
ja: 図12

source: Figure 13.
ja: 図13

source: Figure 14 illustrates a simplistic view of a compliance usage process.
ja: 図14は、コンプライアンス利用プロセスの簡略化された図を示しています。

source: Figure 14.
ja: 図14.

source: Figure 15 (page 81) illustrates some of the factors that can trigger a source code scan, which include:
ja: 図15（82ページ）は、ソース コード スキャンを開始する要因を示しています。それらは、

source: Figure 15.
ja: 図15.

source: Figure 16.
ja: 図16

source: Figure 17 (next page) provides a detailed process that highlights several possible scenarios, and how to move from one step to another in the compliance process.
ja: 図17（次ページ）は、いくつかの可能なシナリオと、コンプライアンス プロセスにおいて、一つのステップから別のステップへどのように状態遷移するかについて、詳細なプロセスを示しています。

source: Figure 17.
ja: 図17

source: Figure 18.
ja: 図18

source: Figure 19 illustrates product development and incremental compliance.
ja: 図19は、製品開発とインクリメンタル コンプライアンスを示しています。

source: Figure 19.
ja: 図19

source: Figure 2 (next page) illustrates the multi-source development model and the various combinations of sources for incoming source code.
ja: 図２（次ページ）に複数のソースによる開発モデル、および入ってくるソースコードの様々な組み合わせを示します。

source: Figure 2.
ja: 図 2

source: Figure 20 (next page) provides an overview of the incremental compliance process.
ja: 図20（次ページ）は、インクリメンタル コンプライアンス プロセスの全体像を示しています。

source: Figure 20.
ja: 図20

source: Figure 21 provides an example architectural diagram that shows:
ja: 図21は、アーキテクチャー図の一例です。この図では、以下を示します。

source: Figure 21.
ja: 図21

source: Figure 22: Basic audit process
ja: 図22：基本監査プロセス

source: Figure 23 illustrates a sample distribution process.
ja: 図23は、頒布プロセスの例を示します。

source: Figure 23.
ja: 図23

source: Figure 24.
ja: 図24

source: Figure 25, created for illustration purposes, shows the sample output of a homegrown BOM difference tool.
ja: 図25は、図での説明目的のために作られてものですが、自社内製のBOM差分ツールのサンプル出力を示しています。

source: Figure 25.
ja: 図25

source: Figure 26 presents a sample inquiry response process that illustrates the steps a compliance inquiry goes through, from receiving the inquiry until its closure.
ja: 図26は、照会を受け取ってからクローズするまでの各段階を説明する、コンプライアンスに関する照会への対応プロセス例を提示します。

source: Figure 26.
ja: 図26

source: Figure 27 (next page) provides an example license playbook for the GPL v2.
ja: 図27（次ページ）は、GPL v2に関するライセンス プレーブックの例を示します。

source: Figure 27.
ja: 図27

source: Figure 28 illustrates the creation of a single source component that originated from multiple sources under different licenses.
ja: 図28は、異なるライセンスで許諾された複数のソースからなる一つのソース コンポーネントを生成する例を示します。

source: Figure 28.
ja: 図28

source: Figure 29 (next page) presents an example license classification, in which most-used licenses are divided into four categories.
ja: 図29（次ページ）は、最もよく使用するライセンスを4つのカテゴリに分類している、ライセンス分類の例です。

source: Figure 29.
ja: 図29

source: Figure 3 (next page) illustrates the adoption of open source software throughout the various levels of a given platform or software stack.
ja: 図３（次ページ）はあるプラットフォームやソフトウェアスタックにおいて、様々な階層でオープンソースソフトウェアを受けいれる様子を示したものです。

source: Figure 3.
ja: 図3

source: Figure 4 described the essential elements needed for a successful compliance program.
ja: 図4はコンプライアンス プログラムの成功に必須の構成要素を示しています。

source: Figure 4.
ja: 図4

source: Figure 5 (next page) illustrates a sample compliance process, with the various steps each software component will go through as part of the due diligence.
ja: 図５（次ページ）はコンプライアンス プロセスの例を図示したもので、個々のソフトウェア コンポーネントが精査の一環として通るべき様々なステップを示しています。

source: Figure 5.
ja: 図5

source: Figure 6 (next page) illustrates the pair of teams involved in achieving compliance: the core team and the extended team.
ja: 図６（次ページ）はコンプライアンス達成のためのこれら二つ、コアチームと拡大チーム、を図示しています。

source: Figure 6.
ja: 図6

source: Figure 7 illustrates the concept of incremental compliance, whereby you need to ensure compliance of whatever source code changes took place between the initial compliant baseline and the current versio
ja: 図7に積み上げのコンプライアンスの概念を示します。ここでは初期のコンプライアンスの起点と現在のバージョンとの間で起きたソースコードの変更が何であれ、コンプライアンスを確実に満たすことが必要となります。

source: Figure 7.
ja: 図7

source: Figure 8 presents a breakdown of the different departments responsible for achieving open source compliance.
ja: 図8はオープンソース コンプライアンスの達成に責任がある様々な部門を書き下したものです。

source: Figure 8.
ja: 図8

source: Figure 9, on the next page, provides an illustration of how such notices are prepared and approved.
ja: 次ページの図9にそうした告知を準備し承認するプロセスを図示しています。

source: Figure 9.
ja: 図9

source: File inventory
ja: ファイル一覧表

source: File inventory .
ja: ファイル一覧表

source: Files pending identification .
ja: 特定保留中のファイル

source: Fill out OSRB forms for each open source component they use .
ja: 利用するオープン ソース コンポーネント毎にOSRBフォームを記入する。

source: Fill out an OSRB usage request form for each open source component in use.
ja: 利用するそれぞれのオープン ソース コンポーネントに対してOSRB利用要求フォームを記入します。

source: Final Approval Phase
ja: 最終承認フェーズ

source: Final Approval Phase 87
ja: 最終承認フェーズ 87

source: Final Review
ja: 最終レビュー

source: Final Review 83
ja: 最終レビュー 83

source: Final Verifications
ja: 最終検証

source: Final Verifications Once you upload the open source packages to the distribution website, validate that the packages have been uploaded correctly and can be downloaded and uncompressed on an external computer without errors.
ja: 最終検証 オープン ソース パッケージを頒布用のウェブサイトにアップロードしたら、パッケージが正しくアップロードされ、ダウンロードでき、エラー無しに外部コンピューターで解凍できることを確認します。

source: Final Verifications 76
ja: 最終検証 76

source: Final verifications outcome
ja: 最終検証の結果

source: Final verifications outcome You receive verification that the source code is uploaded correctly and accessible for download, and that it corresponds to the same version that was approved.
ja: 最終検証の結果 ソース コードは正しくアップロードされ、ダウンロード可能で、承認されたものと同じバージョンに対応しているという確認結果を受けます。

source: Final verifications phase prerequisite:
ja: 最終検証フェーズの前提条件

source: Finally, there are less-common ways in which companies benefit from strong open source compliance practices.
ja: 最後に、頻度は下がるが強固なコンプライアンスのプログラムがもたらす利益として、

source: Firstly, it requires a lot of effort to package all source code and make it available on the website by the date the product ships, at a time when all hands are on deck getting the product out the door.
ja: まず第1に、全てのソース コードをパッケージ化し、製品出荷の準備を整える出荷日までに、ウェブサイト上でソース コードを入手可能にするという多大な努力が必要です。

source: Flag any dependencies, code matches, and licensing conflicts
ja: 全ての依存関係、コード一致、ライセンス矛盾にフラグを付けます。

source: Follow a detailed compliance checklist to ensure that all compliance action items have been completed when a given product, application, or software stack is released into the market
ja: 詳細なコンプライアンス チェック リストに従い、製品やアプリケーション、ソフトウェアスタックの出荷時には全てのコンプライアンス上のアクション アイテムが完了したことを確認

source: Follow compliance policies and processes
ja: コンプライアンス ポリシーとプロセスの遵守

source: Follow compliance policies and processes Integrate compliance practices in dev process
ja: コンプライアンスポリシーとプロセスの遵守 コンプライアンスの実践を開発プロセスの中に統合

source: Follow technical compliance guidelines
ja: 技術的なコンプライアンス プログラムの遵守

source: Follow technical compliance guidelines: Engineering and product teams should follow OSRB technical guidelines to architect, design, integrate, and implement source code.
ja: 技術上のコンプライアンスのガイドラインの順守：エンジニアリングと製品のチームはソースコードに関するOSRBの構想、設計、統合、実装についての技術ガイドラインを遵守すべきです。

source: Following this approach, the company’s modifications are clearly separated from the original open source code.
ja: このアプローチに従えば、会社の修正は、オリジナル ソース コードと明らかに分離されます。

source: Following this distribution method, you provide exclusive access to your customers only, as they are the only entities eligible to receive the source code.
ja: この頒布方法によれば、ソース コードを入手する資格を持っている顧客だけが、排他的にアクセス権を与えられます。

source: Following this distribution method, you provide the code when or shortly after your product or software stack ships, and make it made available to anyone who wishes to get it, typically via a website download.
ja: この頒布方法に従い、製品やソフトウェア スタックの出荷時または直後にコードを提供し、一般的にはウェブサイトからダウンロードによって、コードを欲しい人は誰でも入手できるようにします。

source: Following this method, the required notices file will always be up to date and will include lists of all open source, license information, copyright, and attributions notices.
ja: この方法に従いますと、要求される通知ファイルは、常に最新に更新され、全てのオープン ソースのリスト、ライセンス情報、著作権、帰属通知を含むことになります。

source: FooBar Inc.
ja: Foobar株式会社

source: FooBar makes every possible effort to make the source code publicly available at http:// opensource.foobar.com (“Website”) within reasonable business delays.
ja: FooBarは、妥当な遅延の範囲で、http://opensource.foobar.com (“Website”)にてソース コードが入手可能になるように可能な全ての努力をいたします。

source: FooBar makes every possible effort to make the source code publicly available at http://opensource.foobar.com (“Website”) within reasonable business delays.
ja: FooBarは、妥当な遅延の範囲で、http://opensource.foobar.com (“Website”)にてソース コードが入手可能になるように可能な全ての努力をいたします。

source: For all products, copyright information must be included in printed documentation (such as a user manual).
ja: 全ての製品に関して、著作権情報は、（ユーザーマニュアルのような）印刷物に含まれていなければなりません。

source: For any given software components, the reviewers of the compliance ticket are:
ja: 与えられたソフトウェア コンポーネントに対する、コンプライアンス チケットのレビュアーは、

source: For any given software components, the reviewers of the compliance ticket are: .
ja: 与えられたソフトウェア コンポーネントに対する、コンプライアンス チケットのレビュアーは、： .

source: For companies using open source software in their commercial products, it is recommended to develop and maintain a good relationship with the members of the open source communities that create and sustain the open source code they consume.
ja: オープンソース ソフトウェアを自社製品で利用する企業は、利用しているコードを開発し維持七得るオープンソース コミュニティと良い関係を持ち、維持することが望ましいです。

source: For each product or service containing or using open source, the attributions must be included in published user documentation (such as the product manual) distributed in printed or electronic form, such as a CD or a download from a website.
ja: オープン ソースを含むあるいは利用している製品やサービスに関していうと、帰属は、（製品マニュアル等の）印刷されたユーザー文書や、CDまたはウェブサイトからのダウンロードなど、印刷または電子形式で頒布されなくてはなりません。

source: For example, a well-founded compliance program can help a company be prepared for possible acquisition, sale, or new product or service release, where open source compliance assurance is a mandatory practice before the completion of such transactions.
ja: 例えば、会社の買収や売却、新製品や新サービスのリリースのためより良い準備となる、が挙げられます。オープンソースへのコンプライアンスの保証はそうした業務が完了する前に終了させることが必須だからです。

source: For example, looking at Table 9, source code licensed under License-B can dynamically link to source code license under License-D.
ja: 例えば、表9で、ライセンスBで許諾されたソース コードは、ライセンスDで許諾されたソース コードと動的にリンクすることが可能です。

source: For example:
ja: 例

source: For instance, if the developer declared that they will dynamically link that component to an LGPL licensed library, then we need to verify they’ve done so, and have not used a static linkage method instead.
ja: 例えば、開発者がコンポーネントをLGPLで許諾されたライブラリと動的にリンクすると宣言したならば、その通りになっていて、代わりに静的リンクを使っていないことを検証する必要があります。
